{
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential",
      "layers": [
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              28,
              28,
              1
            ],
            "dtype": "float32",
            "sparse": false,
            "ragged": false,
            "name": "input_layer"
          }
        },
        {
          "class_name": "Conv2D",
          "config": {
            "name": "conv2d",
            "trainable": true,
            "filters": 32,
            "kernel_size": [
              3,
              3
            ],
            "strides": [
              1,
              1
            ],
            "padding": "valid",
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "activation": "relu",
            "use_bias": true,
            "dtype": "float32"
          }
        },
        {
          "class_name": "Conv2D",
          "config": {
            "name": "conv2d_1",
            "trainable": true,
            "filters": 64,
            "kernel_size": [
              3,
              3
            ],
            "strides": [
              1,
              1
            ],
            "padding": "valid",
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "activation": "relu",
            "use_bias": true,
            "dtype": "float32"
          }
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "name": "max_pooling2d",
            "trainable": true,
            "pool_size": [
              2,
              2
            ],
            "strides": [
              2,
              2
            ],
            "padding": "valid",
            "data_format": "channels_last",
            "dtype": "float32"
          }
        },
        {
          "class_name": "Dropout",
          "config": {
            "name": "dropout",
            "trainable": true,
            "rate": 0.25,
            "dtype": "float32"
          }
        },
        {
          "class_name": "Flatten",
          "config": {
            "name": "flatten",
            "trainable": true,
            "dtype": "float32"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense",
            "trainable": true,
            "units": 128,
            "activation": "relu",
            "use_bias": true,
            "dtype": "float32"
          }
        },
        {
          "class_name": "Dropout",
          "config": {
            "name": "dropout_1",
            "trainable": true,
            "rate": 0.5,
            "dtype": "float32"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_1",
            "trainable": true,
            "units": 10,
            "activation": "softmax",
            "use_bias": true,
            "dtype": "float32"
          }
        }
      ]
    },
    "keras_version": "2.4.0",
    "backend": "tensorflow"
  },
  "weightsManifest": [
    {
      "paths": [
        "weights.bin"
      ],
      "weights": [
        {
          "name": "conv2d/kernel",
          "shape": [
            3,
            3,
            1,
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d/bias",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_1/kernel",
          "shape": [
            3,
            3,
            32,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_1/bias",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "dense/kernel",
          "shape": [
            9216,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "dense/bias",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_1/kernel",
          "shape": [
            128,
            10
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_1/bias",
          "shape": [
            10
          ],
          "dtype": "float32"
        }
      ]
    }
  ],
  "format": "layers-model",
  "generatedBy": "keras",
  "convertedBy": "manual"
}